# Transform1D Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Transform1D Properties
Transform1D Class See Also
---
The Transform1D type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Determinant | The determinant of this transformation. |
| IsIdentity | The boolean value that indicates whether this transformation is an identity. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Scale | The real number that represents the scale of this transformation. |
| Translation | The translational part of this transformation. |

# See Also
Transform1D Class
Autodesk.Revit.DB Namespace